Documents/Приложение1КНалоговойНакладной.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Приложение1КНалоговойНакладной</Name>
			<BasedOn>
				<xr:Item>Document.НалоговаяНакладная</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПриложение1КНалоговойНакладной</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДСДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговаяНакладная</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НалоговаяНакладная</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КтоВыписалНалоговуюНакладную</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалогообложениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоОтгружено</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоОсталось</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСкидкиНаценки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодУКТВЭД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторУКТВЭД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерГТД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВнеоборотныеАктивы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоОтгружено</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоОсталось</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодУКТВЭД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторУКТВЭД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерГТД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ФИОФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ФИОФизЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Приложение1КНалоговойНакладной/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ИнтерфейсПечати

// Функция формирует печатную форму документа по указанному макету.
//
// Параметры:
//	ТабличныйДокумент - ТабличныйДокумент в который будет выводится печатная
//				   форма.
//  ИмяМакета    - Строка, имя макета печатной формы.
//
Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати)
	
	Перем СтруктураШапкиДокумента;
	Перем ТаблицаНоменклатуры, ТаблицаПоУслугам, ТаблицаПоОС;
	
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.КлючПараметровПечати = "ПараметрыПечати_ПриходнаяНакладная";
	
	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Приложение1КНалоговойНакладной";
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Приложение1КНалоговойНакладной.ПФ_MXL_Приложение1КНалоговойНакладной");
		
		Если ТекущийДокумент.Дата >= '20110110' Тогда
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Приложение1КНалоговойНакладной.ПФ_MXL_Приложение1КНалоговойНакладной2011");
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент.Ссылка);
		Запрос.УстановитьПараметр("ЕдИзмОС", Справочники.КлассификаторЕдиницИзмерения.шт);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Приложение1.Дата КАК Дата,
		|	Приложение1.Контрагент.НаименованиеПолное КАК Контрагент,
		|	Приложение1.Организация КАК Организация,
		|	Приложение1.Договор КАК ДоговорКонтрагента,
		|	Приложение1.Договор.Наименование КАК ДоговорНаименованиеДляПечати,
		|	Приложение1.НалоговаяНакладная,
		|	Приложение1.НалоговаяНакладная.Дата КАК ДатаНалоговойНакладной,
		|	Приложение1.КтоВыписалНалоговуюНакладную.Представление КАК КтоВыписалНалоговуюНакладную,
		|	Приложение1.Договор.НомерДоговора КАК ДоговорНомер,
		|	Приложение1.Договор.ДатаДоговора КАК ДоговорДата,
		|	Приложение1.Запасы.(
		|		НомерСтроки,
		|		Номенклатура.НаименованиеПолное КАК Номенклатура,
		|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|		Количество,
		|		КоличествоОтгружено,
		|		КоличествоОсталось,
		|		ВЫБОР
		|			КОГДА Приложение1.СуммаВключаетНДС
		|				ТОГДА Приложение1.Запасы.Цена / (1 + Приложение1.Запасы.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение1.Запасы.Цена
		|		КОНЕЦ КАК ЦенаБезНДС,
		|		ВЫБОР
		|			КОГДА Приложение1.СуммаВключаетНДС
		|				ТОГДА Приложение1.Запасы.Сумма / (1 + Приложение1.Запасы.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение1.Запасы.Сумма
		|		КОНЕЦ КАК СуммаБезНДС
		|	),
		|	Приложение1.ОС.(
		|		НомерСтроки,
		|		ОсновноеСредство.Наименование КАК Номенклатура,
		|		&ЕдИзмОС КАК ЕдиницаИзмерения,
		|		1 КАК Количество,
		|		КоличествоОтгружено,
		|		КоличествоОсталось,
		|		ВЫБОР
		|			КОГДА Приложение1.СуммаВключаетНДС
		|				ТОГДА Приложение1.ОС.Сумма / (1 + Приложение1.ОС.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение1.ОС.Сумма
		|		КОНЕЦ КАК СуммаБезНДС,
		|		ВЫБОР
		|			КОГДА Приложение1.СуммаВключаетНДС
		|				ТОГДА Приложение1.ОС.Сумма / (1 + Приложение1.ОС.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение1.ОС.Сумма
		|		КОНЕЦ КАК ЦенаБезНДС
		|	),
		|	Приложение1.Номер,
		|	Приложение1.Дата КАК ДатаДокумента,
		|	Приложение1.Организация.Префикс КАК Префикс,
		|	Приложение1.НалоговаяНакладная.СпецРежимНалогообложения КАК СпецРежимНалогообложенияНалоговойНакладной
		|ИЗ
		|	Документ.Приложение1КНалоговойНакладной КАК Приложение1
		|ГДЕ
		|	Приложение1.Ссылка = &ТекущийДокумент";
		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		
		Если Шапка.ДатаДокумента < Дата('20110101') Тогда
			НомерДокумента = УправлениеНебольшойФирмойСервер.ПолучитьНомерНаПечать(Шапка.Номер, Шапка.Префикс);
		Иначе
			НомерДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.Номер, Истина, Истина);
		КонецЕсли;
		
		ТаблицаЗапасы = Шапка.Запасы.Выгрузить();
		ТаблицаОС = Шапка.ОС.Выгрузить();
		
		Если ТаблицаЗапасы.Количество() > 0 тогда
			ТаблицаНоменклатуры = ТаблицаЗапасы.Скопировать();
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаОС , ТаблицаНоменклатуры);
		Иначе
			ТаблицаНоменклатуры = ТаблицаОС.Скопировать();
		КонецЕсли;
		
		ТабДокумент = Новый ТабличныйДокумент;
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Приложени1КНалоговойНакладной_Приложение1";
		КодЯзыкаПечать = "uk";
		СведенияОПродавце	= УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата, , , КодЯзыкаПечать);
		НазваниеОрганизации	= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
		
		ДоговорНаименованиеДляПечати = "№ " + СокрЛП(Шапка.ДоговорНомер) + " від " +Формат(Шапка.ДоговорДата,"ДФ=dd.MM.yyyy");
		
		Для Страница = 1 По 2 Цикл
			
			// Выводим отступ
			ОбластьМакета = Макет.ПолучитьОбласть("Пробел");
			ТабДокумент.Вывести(ОбластьМакета);
			
			// Выводим область оригинал/копия
			Если Страница = 1 Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Оригинал");
				ТабДокумент.Вывести(ОбластьМакета);
			ИначеЕсли Страница = 2 Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ПерваяКопия");
				ТабДокумент.Вывести(ОбластьМакета);
			КонецЕсли;
			
			// Выводим заголовок накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			
			ОбластьМакета.Параметры.Заполнить(Шапка);
			
			Если  ТекущийДокумент.Дата < '20110110' Тогда
				ОбластьМакета.Параметры.ДатаНалоговойНакладной  = Формат(Шапка.ДатаНалоговойНакладной, "ДФ=dd.MM.yy" );
				ОбластьМакета.Параметры.НомерНалоговойНакладной = НомерДокумента;
			Иначе	
				//Дата налоговой
				ТекДатаНалоговой = Формат(Шапка.ДатаНалоговойНакладной, "ДФ=ddMMyyyy");
				Для Инд = 1 По 8 Цикл
					ОбластьМакета.Параметры["ДатаНалоговой_"+Инд]    = Сред(ТекДатаНалоговой, Инд, 1);
				КонецЦикла; 
				
				// Номер налоговой
				ТекНомерНалоговой = Прав("       " + СокрЛП(НомерДокумента), 7);
				Для Инд = 1 По 7 Цикл                                                                 
					ОбластьМакета.Параметры["НомерНалоговой_"+Инд]    = Сред(ТекНомерНалоговой, Инд, 1);
				КонецЦикла; 
				
				// филиал/спецрежим налоговой
				ТекНомерФилиалНалоговой = "";
				Если ЗначениеЗаполнено(Шапка.СпецРежимНалогообложенияНалоговойНакладной) Тогда
					ТекНомерФилиалНалоговой	= "" + Шапка.СпецРежимНалогообложенияНалоговойНакладной + ТекНомерФилиалНалоговой; 
				КонецЕсли;
				Для Инд = 1 По 4 Цикл                                                                 
					ОбластьМакета.Параметры["НомерФилиалНалоговой_"+Инд]    = Сред(ТекНомерФилиалНалоговой, Инд, 1);
				КонецЦикла;			
				
				//Дата
				ТекДата = Формат(Шапка.Дата, "ДФ=ddMMyyyy");
				Для Инд = 1 По 8 Цикл
					ОбластьМакета.Параметры["Дата_"+Инд]    = Сред(ТекДата, Инд, 1);
				КонецЦикла; 
			КонецЕсли; 
			
			ТабДокумент.Вывести(ОбластьМакета);
			
			// Выводим шапку накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ТабДокумент.Вывести(ОбластьМакета);
			
			НомерПП = 0;
			// Выводим табличную часть
			ОбластьМакета = Макет.ПолучитьОбласть("Строка");
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				// Теперь заполним
				ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
				
				НомерПП = НомерПП + 1;
				ОбластьМакета.Параметры.НомерПП = НомерПП;
				
				// Договор + продавец
				ОбластьМакета.Параметры.ДоговорКонтрагента = "" + ДоговорНаименованиеДляПечати + ", " + НазваниеОрганизации;
				
				// номенклатура с учетом харакетристики
				ОбластьМакета.Параметры.Номенклатура = "" + СтрокаТаблицы.Номенклатура;
				
				ТабДокумент.Вывести(ОбластьМакета);
			КонецЦикла;
			
			
			// Выводим подвал накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			
			ОбластьМакета.Параметры.Заполнить(Шапка);
			ОбластьМакета.Параметры.ИтогСуммаБезНДС = ТаблицаНоменклатуры.Итог("СуммаБезНДС");
			
			ТабДокумент.Вывести(ОбластьМакета);
			
			Если Страница <> 2 Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
		КонецЦикла; 
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ТабДокумент);
		
	КонецЦикла;
	
	ТабДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабДокумент;
	
КонецФункции // ПечатнаяФорма()

// Функция формирует печатную форму документа по указанному макету.
//
// Параметры:
//	ТабличныйДокумент - ТабличныйДокумент в который будет выводится печатная
//				   форма.
//  ИмяМакета    - Строка, имя макета печатной формы.
//
Функция ПечатнаяФормаНалоговыйКодекс2012(МассивОбъектов, ОбъектыПечати)
	
	Перем СтруктураШапкиДокумента;
	Перем ТаблицаНоменклатуры, ТаблицаПоУслугам, ТаблицаПоОС;
	
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.КлючПараметровПечати = "ПараметрыПечати_ПриходнаяНакладная";
	
	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Приложение1КНалоговойНакладной";
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Приложение1КНалоговойНакладной.ПФ_MXL_Приложение1КНалоговойНакладной2012");
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент.Ссылка);
		Запрос.УстановитьПараметр("ЕдИзмОС", Справочники.КлассификаторЕдиницИзмерения.шт);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Приложение1.Дата КАК Дата,
		|	Приложение1.Контрагент.НаименованиеПолное КАК Контрагент,
		|	Приложение1.Организация КАК Организация,
		|	Приложение1.Договор КАК ДоговорКонтрагента,
		|	Приложение1.Договор.Наименование КАК ДоговорНаименованиеДляПечати,
		|	Приложение1.НалоговаяНакладная,
		|	Приложение1.НалоговаяНакладная.Дата КАК ДатаНалоговойНакладной,
		|	Приложение1.КтоВыписалНалоговуюНакладную.Представление КАК КтоВыписалНалоговуюНакладную,
		|	Приложение1.Договор.НомерДоговора КАК ДоговорНомер,
		|	Приложение1.Договор.ДатаДоговора КАК ДоговорДата,
		|	Приложение1.Запасы.(
		|		НомерСтроки,
		|		Номенклатура.НаименованиеПолное КАК Номенклатура,
		|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|		Количество,
		|		КоличествоОтгружено,
		|		КоличествоОсталось,
		|		ВЫБОР
		|			КОГДА Приложение1.СуммаВключаетНДС
		|				ТОГДА Приложение1.Запасы.Цена / (1 + Приложение1.Запасы.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение1.Запасы.Цена
		|		КОНЕЦ КАК ЦенаБезНДС,
		|		ВЫБОР
		|			КОГДА Приложение1.СуммаВключаетНДС
		|				ТОГДА Приложение1.Запасы.Сумма / (1 + Приложение1.Запасы.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение1.Запасы.Сумма
		|		КОНЕЦ КАК СуммаБезНДС,
		|		КодУКТВЭД,
		|		Характеристика,
		|		НомерГТД,
		|		НомерГТД.Дата КАК ДатаГТД
		|	),
		|	Приложение1.ОС.(
		|		НомерСтроки,
		|		ОсновноеСредство.Наименование КАК Номенклатура,
		|		&ЕдИзмОС КАК ЕдиницаИзмерения,
		|		1 КАК Количество,
		|		КоличествоОтгружено,
		|		КоличествоОсталось,
		|		ВЫБОР
		|			КОГДА Приложение1.СуммаВключаетНДС
		|				ТОГДА Приложение1.ОС.Сумма / (1 + Приложение1.ОС.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение1.ОС.Сумма
		|		КОНЕЦ КАК СуммаБезНДС,
		|		ВЫБОР
		|			КОГДА Приложение1.СуммаВключаетНДС
		|				ТОГДА Приложение1.ОС.Сумма / (1 + Приложение1.ОС.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение1.ОС.Сумма
		|		КОНЕЦ КАК ЦенаБезНДС,
		|		КодУКТВЭД,
		|		НомерГТД,
		|		НомерГТД.Дата КАК ДатаГТД
		|	),
		|	Приложение1.Номер,
		|	Приложение1.Дата КАК ДатаДокумента,
		|	Приложение1.Организация.Префикс КАК Префикс,
		|	Приложение1.НалоговаяНакладная.СпецРежимНалогообложения КАК СпецРежимНалогообложенияНалоговойНакладной,
		|	Приложение1.ВалютаДокумента,
		|	Приложение1.Курс,
		|	Приложение1.Кратность
		|ИЗ
		|	Документ.Приложение1КНалоговойНакладной КАК Приложение1
		|ГДЕ
		|	Приложение1.Ссылка = &ТекущийДокумент";
		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		
		ПечататьКодУКТВЭДБезПробелов = Константы.ПечататьКодУКТВЭДБезПробелов.Получить();
		ПечататьДатыБезРазделителей = НЕ Константы.ПечататьДатыВНалоговыхНакладныхСРазделителями.Получить();
		ДополнитьНазваниеНомеромГТД = НЕ Константы.НеДополнятьНаименованиеНомеромГТДВНалоговыхДокументах.Получить();
		
		Если Шапка.ДатаДокумента < Дата('20110101') Тогда
			НомерДокумента = УправлениеНебольшойФирмойСервер.ПолучитьНомерНаПечать(Шапка.Номер, Шапка.Префикс);
		Иначе
			НомерДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.Номер, Истина, Истина);
		КонецЕсли;
		
		ТаблицаЗапасы = Шапка.Запасы.Выгрузить();
		ТаблицаОС = Шапка.ОС.Выгрузить();
		
		Если ТаблицаЗапасы.Количество() > 0 тогда
			ТаблицаНоменклатуры = ТаблицаЗапасы.Скопировать();
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаОС , ТаблицаНоменклатуры);
		Иначе
			ТаблицаНоменклатуры = ТаблицаОС.Скопировать();
		КонецЕсли;
		
		// пересчитаем суммы, если валюта документа отлична от гривны
		ВалютаУчета = Константы.ВалютаУчета.Получить();
		Если Шапка.ВалютаДокумента <> ВалютаУчета Тогда
			
			СтруктураКурсовВалют = УправлениеНебольшойФирмойСервер.ПолучитьКурсыВалют(Шапка.ВалютаДокумента, ВалютаУчета, Шапка.Дата);
			
			Для каждого Строка Из ТаблицаНоменклатуры Цикл
				
				Строка.СуммаБезНДС = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.СуммаБезНДС,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
																			
																			
				Строка.ЦенаБезНДС = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.ЦенаБезНДС,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
		
			КонецЦикла; 
			
		КонецЕсли;
		
		ТабДокумент = Новый ТабличныйДокумент;
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Приложени1КНалоговойНакладной_Приложение1";
		КодЯзыкаПечать = "uk";
		СведенияОПродавце	= УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата, , , КодЯзыкаПечать);
		НазваниеОрганизации	= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
		
		//ДоговорНаименованиеДляПечати = "№ " + СокрЛП(Шапка.ДоговорНомер) + " від " +Формат(Шапка.ДоговорДата,"ДФ=dd.MM.yyyy");
		
		Для Страница = 1 По 2 Цикл
			
			// Выводим отступ
			ОбластьМакета = Макет.ПолучитьОбласть("Пробел");
			ТабДокумент.Вывести(ОбластьМакета);
			
			// Выводим область оригинал/копия
			Если Страница = 1 Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Оригинал");
				ТабДокумент.Вывести(ОбластьМакета);
			ИначеЕсли Страница = 2 Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ПерваяКопия");
				ТабДокумент.Вывести(ОбластьМакета);
			КонецЕсли;
			
			// Выводим заголовок накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			
			ОбластьМакета.Параметры.Заполнить(Шапка);
			
			Если  ТекущийДокумент.Дата < '20110110' Тогда
				ОбластьМакета.Параметры.ДатаНалоговойНакладной  = Формат(Шапка.ДатаНалоговойНакладной, "ДФ=dd.MM.yy" );
				ОбластьМакета.Параметры.НомерНалоговойНакладной = НомерДокумента;
			Иначе	
				//Дата налоговой
				ТекДатаНалоговой = Формат(Шапка.ДатаНалоговойНакладной, "ДФ=ddMMyyyy");
				Для Инд = 1 По 8 Цикл
					ОбластьМакета.Параметры["ДатаНалоговой_"+Инд]    = Сред(ТекДатаНалоговой, Инд, 1);
				КонецЦикла; 
				
				// Номер налоговой
				ТекНомерНалоговой = Прав("       " + СокрЛП(НомерДокумента), 7);
				Для Инд = 1 По 7 Цикл                                                                 
					ОбластьМакета.Параметры["НомерНалоговой_"+Инд]    = Сред(ТекНомерНалоговой, Инд, 1);
				КонецЦикла; 
				
				// филиал/спецрежим налоговой
				ТекНомерФилиалНалоговой = "";
				Если ЗначениеЗаполнено(Шапка.СпецРежимНалогообложенияНалоговойНакладной) Тогда
					ТекНомерФилиалНалоговой	= "" + Шапка.СпецРежимНалогообложенияНалоговойНакладной + ТекНомерФилиалНалоговой; 
				КонецЕсли;
				Для Инд = 1 По 5 Цикл                                                                 
					ОбластьМакета.Параметры["НомерФилиалНалоговой_"+Инд]    = Сред(ТекНомерФилиалНалоговой, Инд, 1);
				КонецЦикла;			
				
				//Дата
				ТекДата = Формат(Шапка.Дата, "ДФ=ddMMyyyy");
				Для Инд = 1 По 8 Цикл
					ОбластьМакета.Параметры["Дата_"+Инд]    = Сред(ТекДата, Инд, 1);
				КонецЦикла; 
			КонецЕсли; 
			
			ТабДокумент.Вывести(ОбластьМакета);
			
			// Выводим шапку накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ТабДокумент.Вывести(ОбластьМакета);
			
			НомерПП = 0;
			// Выводим табличную часть
			ОбластьМакета = Макет.ПолучитьОбласть("Строка");
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				// Теперь заполним
				ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
				
				Если ПечататьКодУКТВЭДБезПробелов Тогда
					ОбластьМакета.Параметры.КодУКТВЭД = СтрЗаменить(ОбластьМакета.Параметры.КодУКТВЭД, " ", "");
				КонецЕсли;
				
				НомерПП = НомерПП + 1;
				ОбластьМакета.Параметры.НомерПП = НомерПП;
				
				// Договор + продавец
				ОбластьМакета.Параметры.ДоговорКонтрагента = "" + Шапка.ДоговорНаименованиеДляПечати + ", " + НазваниеОрганизации;
			    ОбластьМакета.Параметры.ДоговорКонтрагента = СокрЛП(ОбластьМакета.Параметры.ДоговорКонтрагента);
				
				// номенклатура с учетом харакетристики
				ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура) 
													 + ?(НЕ ЗначениеЗаполнено(СтрокаТаблицы.Характеристика), "", "(" + СтрокаТаблицы.Характеристика +")")
													 + ?(ДополнитьНазваниеНомеромГТД И ЗначениеЗаполнено(СтрокаТаблицы.НомерГТД), ". ВМД №: " + СтрокаТаблицы.НомерГТД + ", дата ВМД: " + Формат(СтрокаТаблицы.ДатаГТД, ?(ПечататьДатыБезРазделителей,"ДФ=ddMMyyyy","ДФ=dd.MM.yyyy")), "");
													 ;
			    ОбластьМакета.Параметры.Номенклатура = СокрЛП(ОбластьМакета.Параметры.Номенклатура);
				
				ТабДокумент.Вывести(ОбластьМакета);
			КонецЦикла;
			
			
			// Выводим подвал накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			
			ОбластьМакета.Параметры.Заполнить(Шапка);
			ОбластьМакета.Параметры.ИтогСуммаБезНДС = ТаблицаНоменклатуры.Итог("СуммаБезНДС");
			
			ТабДокумент.Вывести(ОбластьМакета);
			
			Если Страница <> 2 Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
		КонецЦикла; 
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ТабДокумент);
		
	КонецЦикла;
	
	ТабДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабДокумент;
	
КонецФункции // ПечатнаяФорма()

Функция ПечатнаяФормаНалоговыйКодекс2014(МассивОбъектов, ОбъектыПечати)
	
	Перем СтруктураШапкиДокумента;
	Перем ТаблицаНоменклатуры, ТаблицаПоУслугам, ТаблицаПоОС;
	
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Приложение1КНалоговойНакладной2014";
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Приложение1КНалоговойНакладной.ПФ_MXL_Приложение1КНалоговойНакладной2014");
	    Макет.КодЯзыкаМакета = "ru";
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент.Ссылка);
		Запрос.УстановитьПараметр("ЕдИзмОС", Справочники.КлассификаторЕдиницИзмерения.шт);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Приложение1.Дата КАК Дата,
		|	Приложение1.Контрагент.НаименованиеПолное КАК Контрагент,
		|	Приложение1.Организация КАК Организация,
		|	Приложение1.Договор КАК ДоговорКонтрагента,
		|	Приложение1.Договор.Наименование КАК ДоговорНаименованиеДляПечати,
		|	Приложение1.НалоговаяНакладная,
		|	Приложение1.НалоговаяНакладная.Дата КАК ДатаНалоговойНакладной,
		|	Приложение1.КтоВыписалНалоговуюНакладную КАК КтоВыписалНалоговуюНакладную,
		|	Приложение1.Договор.НомерДоговора КАК ДоговорНомер,
		|	Приложение1.Договор.ДатаДоговора КАК ДоговорДата,
		|	Приложение1.Запасы.(
		|		НомерСтроки,
		|		Номенклатура.НаименованиеПолное КАК Номенклатура,
		|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|		Количество,
		|		КоличествоОтгружено,
		|		КоличествоОсталось,
		|		ВЫБОР
		|			КОГДА Приложение1.СуммаВключаетНДС
		|				ТОГДА Приложение1.Запасы.Цена / (1 + Приложение1.Запасы.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение1.Запасы.Цена
		|		КОНЕЦ КАК ЦенаБезНДС,
		|		ВЫБОР
		|			КОГДА Приложение1.СуммаВключаетНДС
		|				ТОГДА Приложение1.Запасы.Сумма / (1 + Приложение1.Запасы.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение1.Запасы.Сумма
		|		КОНЕЦ КАК СуммаБезНДС,
		|		КодУКТВЭД,
		|		Характеристика,
		|		НомерГТД,
		|		НомерГТД.Дата КАК ДатаГТД
		|	),
		|	Приложение1.ОС.(
		|		НомерСтроки,
		|		ОсновноеСредство.Наименование КАК Номенклатура,
		|		&ЕдИзмОС КАК ЕдиницаИзмерения,
		|		1 КАК Количество,
		|		КоличествоОтгружено,
		|		КоличествоОсталось,
		|		ВЫБОР
		|			КОГДА Приложение1.СуммаВключаетНДС
		|				ТОГДА Приложение1.ОС.Сумма / (1 + Приложение1.ОС.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение1.ОС.Сумма
		|		КОНЕЦ КАК СуммаБезНДС,
		|		ВЫБОР
		|			КОГДА Приложение1.СуммаВключаетНДС
		|				ТОГДА Приложение1.ОС.Сумма / (1 + Приложение1.ОС.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение1.ОС.Сумма
		|		КОНЕЦ КАК ЦенаБезНДС,
		|		КодУКТВЭД,
		|		НомерГТД,
		|		НомерГТД.Дата КАК ДатаГТД
		|	),
		|	Приложение1.Номер,
		|	Приложение1.Дата КАК ДатаДокумента,
		|	Приложение1.Организация.Префикс КАК Префикс,
		|	Приложение1.НалоговаяНакладная.СпецРежимНалогообложения КАК СпецРежимНалогообложения,
		|	Приложение1.ВалютаДокумента,
		|	Приложение1.Курс,
		|	Приложение1.Кратность
		|ИЗ
		|	Документ.Приложение1КНалоговойНакладной КАК Приложение1
		|ГДЕ
		|	Приложение1.Ссылка = &ТекущийДокумент";
		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		
		Если Шапка.ДатаДокумента < Дата('20110101') Тогда
			НомерДокумента = УправлениеНебольшойФирмойСервер.ПолучитьНомерНаПечать(Шапка.Номер, Шапка.Префикс);
		Иначе
			НомерДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.Номер, Истина, Истина);
		КонецЕсли;
		
		ТаблицаЗапасы = Шапка.Запасы.Выгрузить();
		ТаблицаОС = Шапка.ОС.Выгрузить();
		
		Если ТаблицаЗапасы.Количество() > 0 тогда
			ТаблицаНоменклатуры = ТаблицаЗапасы.Скопировать();
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаОС , ТаблицаНоменклатуры);
		Иначе
			ТаблицаНоменклатуры = ТаблицаОС.Скопировать();
		КонецЕсли;
		
		// пересчитаем суммы, если валюта документа отлична от гривны
		ВалютаУчета = Константы.ВалютаУчета.Получить();
		Если Шапка.ВалютаДокумента <> ВалютаУчета Тогда
			
			СтруктураКурсовВалют = УправлениеНебольшойФирмойСервер.ПолучитьКурсыВалют(Шапка.ВалютаДокумента, ВалютаУчета, Шапка.Дата);
			
			Для каждого Строка Из ТаблицаНоменклатуры Цикл
				
				Строка.СуммаБезНДС = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.СуммаБезНДС,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
																			
																			
				Строка.ЦенаБезНДС = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.ЦенаБезНДС,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
		
			КонецЦикла; 
			
		КонецЕсли;
		
		КодЯзыкаПечать = "uk";
		СведенияОПродавце	= УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата, , , КодЯзыкаПечать);
		НазваниеОрганизации	= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
		
		//ДоговорНаименованиеДляПечати = "№ " + СокрЛП(Шапка.ДоговорНомер) + " від " +Формат(Шапка.ДоговорДата,"ДФ=dd.MM.yyyy");
		
		// кто выписал налоговую накладную нужно формировать в виде "И.О. Фамилия"
		ПечКтоВыписалНалоговуюНакладную = "";
		ФИОКтоВыписалНалоговуюНакладную = РегистрыСведений.ФИОФизЛиц.СрезПоследних(Шапка.Дата, Новый Структура("ФизЛицо", Шапка.КтоВыписалНалоговуюНакладную));
		Если ФИОКтоВыписалНалоговуюНакладную.Количество() > 0 Тогда
			ПечКтоВыписалНалоговуюНакладную =  ВРег(Лев(СокрЛ(ФИОКтоВыписалНалоговуюНакладную[0].Имя), 1))
			+ ". "
			+ ВРег(Лев(СокрЛ(ФИОКтоВыписалНалоговуюНакладную[0].Отчество), 1))
			+ ". "
			+ СокрЛП(ФИОКтоВыписалНалоговуюНакладную[0].Фамилия); 
		Иначе
			ПечКтоВыписалНалоговуюНакладную = "" + Шапка.КтоВыписалНалоговуюНакладную;									 
		КонецЕсли;
		
		Для Страница = 1 По 2 Цикл
			
			// Выводим отступ
			ОбластьМакета = Макет.ПолучитьОбласть("Пробел");
			ТабДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Оригинал");
			ТабДокумент.Вывести(ОбластьМакета);
			
			// Выводим заголовок накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			
			ОбластьМакета.Параметры.Заполнить(Шапка);
			
			//Дата налоговой
			ТекДатаНалоговой = Формат(Шапка.ДатаНалоговойНакладной, "ДФ=ddMMyyyy");
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["ДатаНалоговой_"+Инд]    = Сред(ТекДатаНалоговой, Инд, 1);
			КонецЦикла; 
			
			// Номер налоговой
			ТекНомерНалоговой = Прав("       " + СокрЛП(НомерДокумента), 7);
			Для Инд = 1 По 7 Цикл                                                                 
				ОбластьМакета.Параметры["НомерНалоговой_"+Инд]    = Сред(ТекНомерНалоговой, Инд, 1);
			КонецЦикла; 
			
			// филиал/спецрежим налоговой
			ТекНомерФилиал = "";
			КодСпецРежима = ?(ЗначениеЗаполнено(Шапка.СпецРежимНалогообложения), "" + Шапка.СпецРежимНалогообложения, " "); //или пробел или одна цифра
			НомерФилиала  = "";  //число  4 символа, без лидирующих нулей
			Если ЗначениеЗаполнено(КодСпецРежима + НомерФилиала) Тогда
				ТекНомерФилиал	= ТекНомерФилиал + КодСпецРежима + НомерФилиала; 
			КонецЕсли;
			Для Инд = 1 По 5 Цикл                                                                 
				ОбластьМакета.Параметры["НомерФилиалНалоговой_"+Инд]    = Сред(ТекНомерФилиал, Инд, 1);
			КонецЦикла;			
			
			//Дата
			ТекДата = Формат(Шапка.Дата, "ДФ=ddMMyyyy");
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["Дата_"+Инд]    = Сред(ТекДата, Инд, 1);
			КонецЦикла; 
			
			ТабДокумент.Вывести(ОбластьМакета);
			
			// Выводим шапку накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ТабДокумент.Вывести(ОбластьМакета);
			
			НомерПП = 0;
			// Выводим табличную часть
			ОбластьМакета = Макет.ПолучитьОбласть("Строка");
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				// Теперь заполним
				ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
				
				ОбластьМакета.Параметры.КодУКТВЭД = СтрЗаменить(ОбластьМакета.Параметры.КодУКТВЭД, " ", "");
				
				НомерПП = НомерПП + 1;
				ОбластьМакета.Параметры.НомерПП = НомерПП;
				
				// Договор + продавец
				ОбластьМакета.Параметры.ДоговорКонтрагента = "" + Шапка.ДоговорНаименованиеДляПечати + ", " + НазваниеОрганизации;
			    ОбластьМакета.Параметры.ДоговорКонтрагента = СокрЛП(ОбластьМакета.Параметры.ДоговорКонтрагента);
				
				// номенклатура с учетом харакетристики
				ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура);
			    ОбластьМакета.Параметры.Номенклатура = СокрЛП(ОбластьМакета.Параметры.Номенклатура);
				
				ТабДокумент.Вывести(ОбластьМакета);
			КонецЦикла;
			
			
			// Выводим подвал накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			
			ОбластьМакета.Параметры.Заполнить(Шапка);
			ОбластьМакета.Параметры.ИтогСуммаБезНДС = ТаблицаНоменклатуры.Итог("СуммаБезНДС");
		    ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = ПечКтоВыписалНалоговуюНакладную;
			
			ТабДокумент.Вывести(ОбластьМакета);
			
			Если Страница <> 2 Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
		КонецЦикла; 
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ТабДокумент);
		
	КонецЦикла;
	
	ТабДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабДокумент;
	
КонецФункции // ()

Функция ПечатнаяФормаНалоговыйКодекс2014Мес12(МассивОбъектов, ОбъектыПечати)
	
	Перем СтруктураШапкиДокумента;
	Перем ТаблицаНоменклатуры, ТаблицаПоУслугам, ТаблицаПоОС;
	
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Приложение1КНалоговойНакладной2014Мес12";
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Приложение1КНалоговойНакладной.ПФ_MXL_Приложение1КНалоговойНакладной2014Мес12");
	    Макет.КодЯзыкаМакета = "ru";
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент.Ссылка);
		Запрос.УстановитьПараметр("ЕдИзмОС", Справочники.КлассификаторЕдиницИзмерения.шт);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Приложение1.Дата КАК Дата,
		|	Приложение1.Контрагент.НаименованиеПолное КАК Контрагент,
		|	Приложение1.Организация КАК Организация,
		|	Приложение1.Договор КАК ДоговорКонтрагента,
		|	Приложение1.Договор.Наименование КАК ДоговорНаименованиеДляПечати,
		|	Приложение1.НалоговаяНакладная,
		|	Приложение1.НалоговаяНакладная.Дата КАК ДатаНалоговойНакладной,
		|	Приложение1.КтоВыписалНалоговуюНакладную КАК КтоВыписалНалоговуюНакладную,
		|	Приложение1.Договор.НомерДоговора КАК ДоговорНомер,
		|	Приложение1.Договор.ДатаДоговора КАК ДоговорДата,
		|	Приложение1.Запасы.(
		|		НомерСтроки,
		|		Номенклатура.НаименованиеПолное КАК Номенклатура,
		|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|		Количество,
		|		КоличествоОтгружено,
		|		КоличествоОсталось,
		|		ВЫБОР
		|			КОГДА Приложение1.СуммаВключаетНДС
		|				ТОГДА Приложение1.Запасы.Цена / (1 + Приложение1.Запасы.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение1.Запасы.Цена
		|		КОНЕЦ КАК ЦенаБезНДС,
		|		ВЫБОР
		|			КОГДА Приложение1.СуммаВключаетНДС
		|				ТОГДА Приложение1.Запасы.Сумма / (1 + Приложение1.Запасы.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение1.Запасы.Сумма
		|		КОНЕЦ КАК СуммаБезНДС,
		|		КодУКТВЭД,
		|		Характеристика,
		|		НомерГТД,
		|		НомерГТД.Дата КАК ДатаГТД
		|	),
		|	Приложение1.ОС.(
		|		НомерСтроки,
		|		ОсновноеСредство.Наименование КАК Номенклатура,
		|		&ЕдИзмОС КАК ЕдиницаИзмерения,
		|		1 КАК Количество,
		|		КоличествоОтгружено,
		|		КоличествоОсталось,
		|		ВЫБОР
		|			КОГДА Приложение1.СуммаВключаетНДС
		|				ТОГДА Приложение1.ОС.Сумма / (1 + Приложение1.ОС.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение1.ОС.Сумма
		|		КОНЕЦ КАК СуммаБезНДС,
		|		ВЫБОР
		|			КОГДА Приложение1.СуммаВключаетНДС
		|				ТОГДА Приложение1.ОС.Сумма / (1 + Приложение1.ОС.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение1.ОС.Сумма
		|		КОНЕЦ КАК ЦенаБезНДС,
		|		КодУКТВЭД,
		|		НомерГТД,
		|		НомерГТД.Дата КАК ДатаГТД
		|	),
		|	Приложение1.Номер,
		|	Приложение1.Дата КАК ДатаДокумента,
		|	Приложение1.Организация.Префикс КАК Префикс,
		|	Приложение1.НалоговаяНакладная.СпецРежимНалогообложения КАК СпецРежимНалогообложения,
		|	Приложение1.ВалютаДокумента,
		|	Приложение1.Курс,
		|	Приложение1.Кратность
		|ИЗ
		|	Документ.Приложение1КНалоговойНакладной КАК Приложение1
		|ГДЕ
		|	Приложение1.Ссылка = &ТекущийДокумент";
		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		
		Если Шапка.ДатаДокумента < Дата('20110101') Тогда
			НомерДокумента = УправлениеНебольшойФирмойСервер.ПолучитьНомерНаПечать(Шапка.Номер, Шапка.Префикс);
		Иначе
			НомерДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.Номер, Истина, Истина);
		КонецЕсли;
		
		ТаблицаЗапасы = Шапка.Запасы.Выгрузить();
		ТаблицаОС = Шапка.ОС.Выгрузить();
		
		Если ТаблицаЗапасы.Количество() > 0 тогда
			ТаблицаНоменклатуры = ТаблицаЗапасы.Скопировать();
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаОС , ТаблицаНоменклатуры);
		Иначе
			ТаблицаНоменклатуры = ТаблицаОС.Скопировать();
		КонецЕсли;
		
		// пересчитаем суммы, если валюта документа отлична от гривны
		ВалютаУчета = Константы.ВалютаУчета.Получить();
		Если Шапка.ВалютаДокумента <> ВалютаУчета Тогда
			
			СтруктураКурсовВалют = УправлениеНебольшойФирмойСервер.ПолучитьКурсыВалют(Шапка.ВалютаДокумента, ВалютаУчета, Шапка.Дата);
			
			Для каждого Строка Из ТаблицаНоменклатуры Цикл
				
				Строка.СуммаБезНДС = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.СуммаБезНДС,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
																			
																			
				Строка.ЦенаБезНДС = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.ЦенаБезНДС,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
		
			КонецЦикла; 
			
		КонецЕсли;
		
		КодЯзыкаПечать = "uk";
		СведенияОПродавце	= УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата, , , КодЯзыкаПечать);
		НазваниеОрганизации	= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
		
		//ДоговорНаименованиеДляПечати = "№ " + СокрЛП(Шапка.ДоговорНомер) + " від " +Формат(Шапка.ДоговорДата,"ДФ=dd.MM.yyyy");
		
		// кто выписал налоговую накладную нужно формировать в виде "И.О. Фамилия"
		ПечКтоВыписалНалоговуюНакладную = "";
		ФИОКтоВыписалНалоговуюНакладную = РегистрыСведений.ФИОФизЛиц.СрезПоследних(Шапка.Дата, Новый Структура("ФизЛицо", Шапка.КтоВыписалНалоговуюНакладную));
		Если ФИОКтоВыписалНалоговуюНакладную.Количество() > 0 Тогда
			ПечКтоВыписалНалоговуюНакладную =  ВРег(Лев(СокрЛ(ФИОКтоВыписалНалоговуюНакладную[0].Имя), 1))
			+ ". "
			+ ВРег(Лев(СокрЛ(ФИОКтоВыписалНалоговуюНакладную[0].Отчество), 1))
			+ ". "
			+ СокрЛП(ФИОКтоВыписалНалоговуюНакладную[0].Фамилия); 
		Иначе
			ПечКтоВыписалНалоговуюНакладную = "" + Шапка.КтоВыписалНалоговуюНакладную;									 
		КонецЕсли;
		
		Для Страница = 1 По 2 Цикл
			
			// Выводим отступ
			ОбластьМакета = Макет.ПолучитьОбласть("Пробел");
			ТабДокумент.Вывести(ОбластьМакета);
			
			Если Страница = 1 Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Оригинал");
			Иначе	
				ОбластьМакета = Макет.ПолучитьОбласть("Копия");
			КонецЕсли;
			ТабДокумент.Вывести(ОбластьМакета);
			
			// Выводим заголовок накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			
			ОбластьМакета.Параметры.Заполнить(Шапка);
			
			//Дата налоговой
			ТекДатаНалоговой = Формат(Шапка.ДатаНалоговойНакладной, "ДФ=ddMMyyyy");
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["ДатаНалоговой_"+Инд]    = Сред(ТекДатаНалоговой, Инд, 1);
			КонецЦикла; 
			
			// Номер налоговой
			ТекНомерНалоговой = Прав("       " + СокрЛП(НомерДокумента), 7);
			Для Инд = 1 По 7 Цикл                                                                 
				ОбластьМакета.Параметры["НомерНалоговой_"+Инд]    = Сред(ТекНомерНалоговой, Инд, 1);
			КонецЦикла; 
			
			// филиал/спецрежим налоговой
			ТекНомерФилиал = "";
			КодСпецРежима = ?(ЗначениеЗаполнено(Шапка.СпецРежимНалогообложения), "" + Шапка.СпецРежимНалогообложения, " "); //или пробел или одна цифра
			НомерФилиала  = "";  //число  4 символа, без лидирующих нулей
			Если ЗначениеЗаполнено(КодСпецРежима + НомерФилиала) Тогда
				ТекНомерФилиал	= ТекНомерФилиал + КодСпецРежима + НомерФилиала; 
			КонецЕсли;
			Для Инд = 1 По 5 Цикл                                                                 
				ОбластьМакета.Параметры["НомерФилиалНалоговой_"+Инд]    = Сред(ТекНомерФилиал, Инд, 1);
			КонецЦикла;			
			
			//Дата
			ТекДата = Формат(Шапка.Дата, "ДФ=ddMMyyyy");
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["Дата_"+Инд]    = Сред(ТекДата, Инд, 1);
			КонецЦикла; 
			
			ТабДокумент.Вывести(ОбластьМакета);
			
			// Выводим шапку накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ТабДокумент.Вывести(ОбластьМакета);
			
			НомерПП = 0;
			// Выводим табличную часть
			ОбластьМакета = Макет.ПолучитьОбласть("Строка");
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				// Теперь заполним
				ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
				
				ОбластьМакета.Параметры.КодУКТВЭД = СтрЗаменить(ОбластьМакета.Параметры.КодУКТВЭД, " ", "");
				
				НомерПП = НомерПП + 1;
				ОбластьМакета.Параметры.НомерПП = НомерПП;
				
				// Договор + продавец
				ОбластьМакета.Параметры.ДоговорКонтрагента = "" + Шапка.ДоговорНаименованиеДляПечати + ", " + НазваниеОрганизации;
			    ОбластьМакета.Параметры.ДоговорКонтрагента = СокрЛП(ОбластьМакета.Параметры.ДоговорКонтрагента);
				
				// номенклатура с учетом харакетристики
				ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура);
			    ОбластьМакета.Параметры.Номенклатура = СокрЛП(ОбластьМакета.Параметры.Номенклатура);
				
				ТабДокумент.Вывести(ОбластьМакета);
			КонецЦикла;
			
			
			// Выводим подвал накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			
			ОбластьМакета.Параметры.Заполнить(Шапка);
			ОбластьМакета.Параметры.ИтогСуммаБезНДС = ТаблицаНоменклатуры.Итог("СуммаБезНДС");
		    ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = ПечКтоВыписалНалоговуюНакладную;
			
			ТабДокумент.Вывести(ОбластьМакета);
			
			Если Страница <> 2 Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
		КонецЦикла; 
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ТабДокумент);
		
	КонецЦикла;
	
	ТабДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабДокумент;
	
КонецФункции // ()

Функция ПечатнаяФормаНалоговыйКодекс2015(МассивОбъектов, ОбъектыПечати)
	
	Перем СтруктураШапкиДокумента;
	Перем ТаблицаНоменклатуры, ТаблицаПоУслугам, ТаблицаПоОС;
	
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Приложение1КНалоговойНакладной2015";
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Приложение1КНалоговойНакладной.ПФ_MXL_Приложение1КНалоговойНакладной2015");
	    Макет.КодЯзыкаМакета = "ru";
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент.Ссылка);
		Запрос.УстановитьПараметр("ЕдИзмОС", Справочники.КлассификаторЕдиницИзмерения.шт);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Приложение1.Дата КАК Дата,
		|	Приложение1.Контрагент.НаименованиеПолное КАК Контрагент,
		|	Приложение1.Организация КАК Организация,
		|	Приложение1.Договор КАК ДоговорКонтрагента,
		|	Приложение1.Договор.Наименование КАК ДоговорНаименованиеДляПечати,
		|	Приложение1.НалоговаяНакладная,
		|	Приложение1.НалоговаяНакладная.Дата КАК ДатаНалоговойНакладной,
		|	Приложение1.КтоВыписалНалоговуюНакладную КАК КтоВыписалНалоговуюНакладную,
		|	Приложение1.Договор.НомерДоговора КАК ДоговорНомер,
		|	Приложение1.Договор.ДатаДоговора КАК ДоговорДата,
		|	Приложение1.Запасы.(
		|		НомерСтроки,
		|		Номенклатура.НаименованиеПолное КАК Номенклатура,
		|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|		ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
		|		Количество,
		|		КоличествоОтгружено,
		|		КоличествоОсталось,
		|		ВЫБОР
		|			КОГДА Приложение1.СуммаВключаетНДС
		|				ТОГДА Приложение1.Запасы.Цена / (1 + Приложение1.Запасы.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение1.Запасы.Цена
		|		КОНЕЦ КАК ЦенаБезНДС,
		|		ВЫБОР
		|			КОГДА Приложение1.СуммаВключаетНДС
		|				ТОГДА Приложение1.Запасы.Сумма / (1 + Приложение1.Запасы.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение1.Запасы.Сумма
		|		КОНЕЦ КАК СуммаБезНДС,
		|		КодУКТВЭД,
		|		Характеристика,
		|		НомерГТД,
		|		НомерГТД.Дата КАК ДатаГТД
		|	),
		|	Приложение1.ОС.(
		|		НомерСтроки,
		|		ОсновноеСредство.Наименование КАК Номенклатура,
		|		&ЕдИзмОС КАК ЕдиницаИзмерения,
		|		1 КАК Количество,
		|		КоличествоОтгружено,
		|		КоличествоОсталось,
		|		ВЫБОР
		|			КОГДА Приложение1.СуммаВключаетНДС
		|				ТОГДА Приложение1.ОС.Сумма / (1 + Приложение1.ОС.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение1.ОС.Сумма
		|		КОНЕЦ КАК СуммаБезНДС,
		|		ВЫБОР
		|			КОГДА Приложение1.СуммаВключаетНДС
		|				ТОГДА Приложение1.ОС.Сумма / (1 + Приложение1.ОС.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение1.ОС.Сумма
		|		КОНЕЦ КАК ЦенаБезНДС,
		|		КодУКТВЭД,
		|		НомерГТД,
		|		НомерГТД.Дата КАК ДатаГТД
		|	),
		|	Приложение1.Номер,
		|	Приложение1.Дата КАК ДатаДокумента,
		|	Приложение1.Организация.Префикс КАК Префикс,
		|	Приложение1.НалоговаяНакладная.СпецРежимНалогообложения КАК СпецРежимНалогообложения,
		|	Приложение1.ВалютаДокумента,
		|	Приложение1.Курс,
		|	Приложение1.Кратность
		|ИЗ
		|	Документ.Приложение1КНалоговойНакладной КАК Приложение1
		|ГДЕ
		|	Приложение1.Ссылка = &ТекущийДокумент";
		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		
		Если Шапка.ДатаДокумента < Дата('20110101') Тогда
			НомерДокумента = УправлениеНебольшойФирмойСервер.ПолучитьНомерНаПечать(Шапка.Номер, Шапка.Префикс);
		Иначе
			НомерДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.Номер, Истина, Истина);
		КонецЕсли;
		
		ТаблицаЗапасы = Шапка.Запасы.Выгрузить();
		ТаблицаОС = Шапка.ОС.Выгрузить();
		
		Если ТаблицаЗапасы.Количество() > 0 тогда
			ТаблицаНоменклатуры = ТаблицаЗапасы.Скопировать();
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаОС , ТаблицаНоменклатуры);
		Иначе
			ТаблицаНоменклатуры = ТаблицаОС.Скопировать();
		КонецЕсли;
		
		// пересчитаем суммы, если валюта документа отлична от гривны
		ВалютаУчета = Константы.ВалютаУчета.Получить();
		Если Шапка.ВалютаДокумента <> ВалютаУчета Тогда
			
			СтруктураКурсовВалют = УправлениеНебольшойФирмойСервер.ПолучитьКурсыВалют(Шапка.ВалютаДокумента, ВалютаУчета, Шапка.Дата);
			
			Для каждого Строка Из ТаблицаНоменклатуры Цикл
				
				Строка.СуммаБезНДС = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.СуммаБезНДС,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
																			
																			
				Строка.ЦенаБезНДС = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.ЦенаБезНДС,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
		
			КонецЦикла; 
			
		КонецЕсли;
		
		КодЯзыкаПечать = "uk";
		СведенияОПродавце	= УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата, , , КодЯзыкаПечать);
		НазваниеОрганизации	= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
		
		//ДоговорНаименованиеДляПечати = "№ " + СокрЛП(Шапка.ДоговорНомер) + " від " +Формат(Шапка.ДоговорДата,"ДФ=dd.MM.yyyy");
		
		// кто выписал налоговую накладную нужно формировать в виде "И.О. Фамилия"
		ПечКтоВыписалНалоговуюНакладную = "";
		ФИОКтоВыписалНалоговуюНакладную = РегистрыСведений.ФИОФизЛиц.СрезПоследних(Шапка.Дата, Новый Структура("ФизЛицо", Шапка.КтоВыписалНалоговуюНакладную));
		Если ФИОКтоВыписалНалоговуюНакладную.Количество() > 0 Тогда
			ПечКтоВыписалНалоговуюНакладную =  ВРег(Лев(СокрЛ(ФИОКтоВыписалНалоговуюНакладную[0].Имя), 1))
			+ ". "
			+ ВРег(Лев(СокрЛ(ФИОКтоВыписалНалоговуюНакладную[0].Отчество), 1))
			+ ". "
			+ СокрЛП(ФИОКтоВыписалНалоговуюНакладную[0].Фамилия); 
		Иначе
			ПечКтоВыписалНалоговуюНакладную = "" + Шапка.КтоВыписалНалоговуюНакладную;									 
		КонецЕсли;
		
		Для Страница = 1 По 1 Цикл
			
			// Выводим отступ
			ОбластьМакета = Макет.ПолучитьОбласть("Пробел");
			ТабДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Оригинал");
				
			ТабДокумент.Вывести(ОбластьМакета);
			
			// Выводим заголовок накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			
			ОбластьМакета.Параметры.Заполнить(Шапка);
			
			//Дата налоговой
			ТекДатаНалоговой = Формат(Шапка.ДатаНалоговойНакладной, "ДФ=ddMMyyyy");
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["ДатаНалоговой_"+Инд]    = Сред(ТекДатаНалоговой, Инд, 1);
			КонецЦикла; 
			
			// Номер налоговой
			ТекНомерНалоговой = Прав("       " + СокрЛП(НомерДокумента), 7);
			Для Инд = 1 По 7 Цикл                                                                 
				ОбластьМакета.Параметры["НомерНалоговой_"+Инд]    = Сред(ТекНомерНалоговой, Инд, 1);
			КонецЦикла; 
			
			// филиал/спецрежим налоговой
			ТекНомерФилиал = "";
			КодСпецРежима = ?(ЗначениеЗаполнено(Шапка.СпецРежимНалогообложения), "" + Шапка.СпецРежимНалогообложения, " "); //или пробел или одна цифра
			НомерФилиала  = "";
			Если ЗначениеЗаполнено(КодСпецРежима + НомерФилиала) Тогда
				ТекНомерФилиал	= ТекНомерФилиал + КодСпецРежима + НомерФилиала; 
			КонецЕсли;
			Для Инд = 1 По 5 Цикл                                                                 
				ОбластьМакета.Параметры["НомерФилиалНалоговой_"+Инд]    = Сред(ТекНомерФилиал, Инд, 1);
			КонецЦикла;			
			
			//Дата
			ТекДата = Формат(Шапка.Дата, "ДФ=ddMMyyyy");
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["Дата_"+Инд]    = Сред(ТекДата, Инд, 1);
			КонецЦикла; 
			
			ТабДокумент.Вывести(ОбластьМакета);
			
			// Выводим шапку накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ТабДокумент.Вывести(ОбластьМакета);
			
			НомерПП = 0;
			// Выводим табличную часть
			ОбластьМакета = Макет.ПолучитьОбласть("Строка");
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				// Теперь заполним
				ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
				
				ОбластьМакета.Параметры.КодУКТВЭД = СтрЗаменить(ОбластьМакета.Параметры.КодУКТВЭД, " ", "");
				
				НомерПП = НомерПП + 1;
				ОбластьМакета.Параметры.НомерПП = НомерПП;
				
				// Договор + продавец
				ОбластьМакета.Параметры.ДоговорКонтрагента = "" + Шапка.ДоговорНаименованиеДляПечати + ", " + НазваниеОрганизации;
			    ОбластьМакета.Параметры.ДоговорКонтрагента = СокрЛП(ОбластьМакета.Параметры.ДоговорКонтрагента);
				
				// номенклатура с учетом харакетристики
				ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура);
			    ОбластьМакета.Параметры.Номенклатура = СокрЛП(ОбластьМакета.Параметры.Номенклатура);
				
				ТабДокумент.Вывести(ОбластьМакета);
			КонецЦикла;
			
			
			// Выводим подвал накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			
			ОбластьМакета.Параметры.Заполнить(Шапка);
			ОбластьМакета.Параметры.ИтогСуммаБезНДС = ТаблицаНоменклатуры.Итог("СуммаБезНДС");
		    ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = ПечКтоВыписалНалоговуюНакладную;
			
			ТабДокумент.Вывести(ОбластьМакета);
			
			Если Страница <> 2 Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
		КонецЦикла; 
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ТабДокумент);
		
	КонецЦикла;
	
	ТабДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабДокумент;
	
КонецФункции // ()

Функция ПечатнаяФормаНалоговыйКодекс2016(МассивОбъектов, ОбъектыПечати)
	
	Перем СтруктураШапкиДокумента;
	Перем ТаблицаНоменклатуры, ТаблицаПоУслугам, ТаблицаПоОС;
	
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Приложение1КНалоговойНакладной2016";
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Приложение1КНалоговойНакладной.ПФ_MXL_Приложение1КНалоговойНакладной2016");
	    Макет.КодЯзыкаМакета = "ru";
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент.Ссылка);
		Запрос.УстановитьПараметр("ЕдИзмОС", Справочники.КлассификаторЕдиницИзмерения.шт);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Приложение1.Дата КАК Дата,
		|	Приложение1.Контрагент.НаименованиеПолное КАК Контрагент,
		|	Приложение1.Организация КАК Организация,
		|	Приложение1.Договор КАК ДоговорКонтрагента,
		|	Приложение1.Договор.Наименование КАК ДоговорНаименованиеДляПечати,
		|	Приложение1.НалоговаяНакладная,
		|	Приложение1.НалоговаяНакладная.Дата КАК ДатаНалоговойНакладной,
		|	Приложение1.КтоВыписалНалоговуюНакладную КАК КтоВыписалНалоговуюНакладную,
		|	Приложение1.Договор.НомерДоговора КАК ДоговорНомер,
		|	Приложение1.Договор.ДатаДоговора КАК ДоговорДата,
		|	Приложение1.Запасы.(
		|		НомерСтроки,
		|		Номенклатура.НаименованиеПолное КАК Номенклатура,
		|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|		ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
		|		Количество,
		|		КоличествоОтгружено,
		|		КоличествоОсталось,
		|		ВЫБОР
		|			КОГДА Приложение1.СуммаВключаетНДС
		|				ТОГДА Приложение1.Запасы.Цена / (1 + Приложение1.Запасы.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение1.Запасы.Цена
		|		КОНЕЦ КАК ЦенаБезНДС,
		|		ВЫБОР
		|			КОГДА Приложение1.СуммаВключаетНДС
		|				ТОГДА Приложение1.Запасы.Сумма / (1 + Приложение1.Запасы.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение1.Запасы.Сумма
		|		КОНЕЦ КАК СуммаБезНДС,
		|		КодУКТВЭД,
		|		Характеристика,
		|		НомерГТД,
		|		НомерГТД.Дата КАК ДатаГТД
		|	),
		|	Приложение1.ОС.(
		|		НомерСтроки,
		|		ОсновноеСредство.Наименование КАК Номенклатура,
		|		&ЕдИзмОС КАК ЕдиницаИзмерения,
		|		1 КАК Количество,
		|		КоличествоОтгружено,
		|		КоличествоОсталось,
		|		ВЫБОР
		|			КОГДА Приложение1.СуммаВключаетНДС
		|				ТОГДА Приложение1.ОС.Сумма / (1 + Приложение1.ОС.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение1.ОС.Сумма
		|		КОНЕЦ КАК СуммаБезНДС,
		|		ВЫБОР
		|			КОГДА Приложение1.СуммаВключаетНДС
		|				ТОГДА Приложение1.ОС.Сумма / (1 + Приложение1.ОС.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение1.ОС.Сумма
		|		КОНЕЦ КАК ЦенаБезНДС,
		|		КодУКТВЭД,
		|		НомерГТД,
		|		НомерГТД.Дата КАК ДатаГТД
		|	),
		|	Приложение1.Номер,
		|	Приложение1.Дата КАК ДатаДокумента,
		|	Приложение1.Организация.Префикс КАК Префикс,
		|	Приложение1.НалоговаяНакладная.СпецРежимНалогообложения КАК СпецРежимНалогообложения,
		|	Приложение1.ВалютаДокумента,
		|	Приложение1.Курс,
		|	Приложение1.Кратность
		|ИЗ
		|	Документ.Приложение1КНалоговойНакладной КАК Приложение1
		|ГДЕ
		|	Приложение1.Ссылка = &ТекущийДокумент";
		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		
		Если Шапка.ДатаДокумента < Дата('20110101') Тогда
			НомерДокумента = УправлениеНебольшойФирмойСервер.ПолучитьНомерНаПечать(Шапка.Номер, Шапка.Префикс);
		Иначе
			НомерДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.Номер, Истина, Истина);
		КонецЕсли;
		
		ТаблицаЗапасы = Шапка.Запасы.Выгрузить();
		ТаблицаОС = Шапка.ОС.Выгрузить();
		
		Если ТаблицаЗапасы.Количество() > 0 тогда
			ТаблицаНоменклатуры = ТаблицаЗапасы.Скопировать();
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаОС , ТаблицаНоменклатуры);
		Иначе
			ТаблицаНоменклатуры = ТаблицаОС.Скопировать();
		КонецЕсли;
		
		// пересчитаем суммы, если валюта документа отлична от гривны
		ВалютаУчета = Константы.ВалютаУчета.Получить();
		Если Шапка.ВалютаДокумента <> ВалютаУчета Тогда
			
			СтруктураКурсовВалют = УправлениеНебольшойФирмойСервер.ПолучитьКурсыВалют(Шапка.ВалютаДокумента, ВалютаУчета, Шапка.Дата);
			
			Для каждого Строка Из ТаблицаНоменклатуры Цикл
				
				Строка.СуммаБезНДС = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.СуммаБезНДС,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
																			
																			
				Строка.ЦенаБезНДС = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.ЦенаБезНДС,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
		
			КонецЦикла; 
			
		КонецЕсли;
		
		КодЯзыкаПечать = "uk";
		СведенияОПродавце	= УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата, , , КодЯзыкаПечать);
		НазваниеОрганизации	= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
		
		Для Страница = 1 По 1 Цикл
			
			// Выводим отступ
			ОбластьМакета = Макет.ПолучитьОбласть("Пробел");
			ТабДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Оригинал");
				
			ТабДокумент.Вывести(ОбластьМакета);
			
			// Выводим заголовок накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			
			ОбластьМакета.Параметры.Заполнить(Шапка);
			
			//Дата налоговой
			ТекДатаНалоговой = Формат(Шапка.ДатаНалоговойНакладной, "ДФ=ddMMyyyy");
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["ДатаНалоговой_"+Инд]    = Сред(ТекДатаНалоговой, Инд, 1);
			КонецЦикла; 
			
			// Номер налоговой
			ТекНомерНалоговой = Прав("       " + СокрЛП(НомерДокумента), 7);
			Для Инд = 1 По 7 Цикл                                                                 
				ОбластьМакета.Параметры["НомерНалоговой_"+Инд]    = Сред(ТекНомерНалоговой, Инд, 1);
			КонецЦикла; 
			
			// филиал/спецрежим налоговой
			КодСпецРежима = ?(ЗначениеЗаполнено(Шапка.СпецРежимНалогообложения), "" + Шапка.СпецРежимНалогообложения, " "); //или пробел или одна цифра
			ОбластьМакета.Параметры.СпецРежим = КодСпецРежима;
			
			ТабДокумент.Вывести(ОбластьМакета);
			
			// Выводим шапку накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ТабДокумент.Вывести(ОбластьМакета);
			
			НомерПП = 0;
			// Выводим табличную часть
			ОбластьМакета = Макет.ПолучитьОбласть("Строка");
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				// Теперь заполним
				ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
				
				ОбластьМакета.Параметры.КодУКТВЭД = СтрЗаменить(ОбластьМакета.Параметры.КодУКТВЭД, " ", "");
				
				НомерПП = НомерПП + 1;
				ОбластьМакета.Параметры.НомерПП = НомерПП;
				
				ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = УчетНДССервер.КодЕдиницыИзмеренияДляПечатиНалоговых(ОбластьМакета.Параметры.ЕдиницаИзмеренияКод);
				
				ОбластьМакета.Параметры.Номенклатура = СокрЛП("" + СтрокаТаблицы.Номенклатура);
				
				ТабДокумент.Вывести(ОбластьМакета);
			КонецЦикла;
			
			
			// Выводим подвал накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			
			ОбластьМакета.Параметры.Заполнить(Шапка);
			ОбластьМакета.Параметры.ИтогСуммаБезНДС = ТаблицаНоменклатуры.Итог("СуммаБезНДС");
			
			ТабДокумент.Вывести(ОбластьМакета);
			
			Если Страница <> 2 Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
		КонецЦикла; 
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ТабДокумент);
		
	КонецЦикла;
	
	ТабДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабДокумент;
	
КонецФункции // ()

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, 
	
	КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	ДатаВступленияВСилуПриказа1379 = Константы.ДатаВступленияВСилуПриказа1379.Получить();
	
    ДатаВступленияВСилуПриказа1307 = УчетНДССервер.ДатаВступленияВСилуПриказа1307();	
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение1КНалоговойНакладной") Тогда
	    Если МассивОбъектов[0].Дата >= ДатаВступленияВСилуПриказа1307 Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Приложение1КНалоговойНакладной", "Приложение №1 к налоговой накладной", ПечатнаяФормаНалоговыйКодекс2016(МассивОбъектов, ОбъектыПечати));
	    ИначеЕсли МассивОбъектов[0].Дата >= '20150101' Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Приложение1КНалоговойНакладной", "Приложение №1 к налоговой накладной", ПечатнаяФормаНалоговыйКодекс2015(МассивОбъектов, ОбъектыПечати));
		ИначеЕсли МассивОбъектов[0].Дата >= '20141201' Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Приложение1КНалоговойНакладной", "Приложение №1 к налоговой накладной", ПечатнаяФормаНалоговыйКодекс2014Мес12(МассивОбъектов, ОбъектыПечати));
		ИначеЕсли МассивОбъектов[0].Дата >= '20110110' И МассивОбъектов[0].Дата < ДатаВступленияВСилуПриказа1379 Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Приложение1КНалоговойНакладной", "Приложение №1 к налоговой накладной", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати));
		ИначеЕсли МассивОбъектов[0].Дата >= ДатаВступленияВСилуПриказа1379 Тогда	
			Если МассивОбъектов[0].Дата >= '20140301' Тогда
				УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Приложение1КНалоговойНакладной", "Приложение №1 к налоговой накладной", ПечатнаяФормаНалоговыйКодекс2014(МассивОбъектов, ОбъектыПечати));
			Иначе
				УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Приложение1КНалоговойНакладной", "Приложение №1 к налоговой накладной", ПечатнаяФормаНалоговыйКодекс2012(МассивОбъектов, ОбъектыПечати));
			КонецЕсли;
		ИначеЕсли МассивОбъектов[0].Дата < '20110101' Тогда	
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Приложение1КНалоговойНакладной", "Приложение №1 к налоговой накладной", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // Печать()

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение1КНалоговойНакладной";
	КомандаПечати.Представление = НСтр("ru='Приложение №1 к налоговой накладной';uk='Додаток №1 до податкової накладної'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка,ФормаСпискаДокументов";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.ПереопределитьПользовательскиеНастройкиКоличества = Истина;
	КомандаПечати.Порядок = 4;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
